Repository: holg/eulumdat-rs
Catalog: EulumdatApp/EulumdatApp/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, pt_br, ru, zh_hans

# ui.spectral.r_fr_hint
source: R:FR ratio affects plant morphology (>1.0 = compact growth)
de: R:FR-Verhältnis beeinflusst Pflanzenmorphologie (>1,0 = kompaktes Wachstum)
es: La relación R:FR afecta la morfología vegetal (>1.0 = crecimiento compacto)
fr: Le ratio R:FR affecte la morphologie des plantes (>1.0 = croissance compacte)
it: Il rapporto R:FR influenza la morfologia delle piante (>1.0 = crescita compatta)
pt_br: A razão R:FR afeta a morfologia vegetal (>1.0 = crescimento compacto)
ru: Соотношение R:FR влияет на морфологию растений (>1.0 = компактный рост)
zh_hans: R:FR 比值影响植物形态（>1.0 = 紧凑生长）

# ui.spectral.sample
source: Sample
de: Beispiel
es: Muestra
fr: Échantillon
it: Campione
pt_br: Amostra
ru: Образец
zh_hans: 示例

# ui.spectral.subtitle
source: ATLA S001 spectral data | CCT/CRI synthesis
de: ATLA S001 Spektraldaten | CCT/CRI-Synthese
es: Datos espectrales ATLA S001 | Síntesis CCT/CRI
fr: Données spectrales ATLA S001 | Synthèse CCT/IRC
it: Dati spettrali ATLA S001 | Sintesi CCT/CRI
pt_br: Dados espectrais ATLA S001 | Síntese CCT/CRI
ru: Спектральные данные ATLA S001 | Синтез CCT/CRI
zh_hans: ATLA S001 光谱数据 | CCT/CRI 合成

# ui.spectral.thermal_warning
source: High infrared content - significant thermal output
de: Hoher Infrarotanteil - erhebliche Wärmeabgabe
es: Alto contenido infrarrojo - salida térmica significativa
fr: Contenu infrarouge élevé - sortie thermique significative
it: Contenuto infrarosso elevato - emissione termica significativa
pt_br: Alto conteúdo infravermelho - saída térmica significativa
ru: Высокое содержание ИК — значительный тепловой выход
zh_hans: 高红外含量 - 显著热输出

# ui.spectral.uv_warning
source: Elevated UV-A content - potential material degradation
de: Erhöhter UV-A-Anteil - mögliche Materialschädigung
es: Contenido UV-A elevado - posible degradación del material
fr: Contenu UV-A élevé - dégradation potentielle des matériaux
it: Contenuto UV-A elevato - potenziale degrado materiali
pt_br: Conteúdo UV-A elevado - possível degradação do material
ru: Повышенное содержание УФ-А — возможная деградация материалов
zh_hans: UV-A 含量升高 - 潜在材料降解

# ui.spectral.warnings
source: Warnings
de: Warnungen
es: Advertencias
fr: Avertissements
it: Avvisi
pt_br: Avisos
ru: Предупреждения
zh_hans: 警告

# ui.spectral.wavelength_range
source: Wavelength Range
de: Wellenlängenbereich
es: Rango de longitud de onda
fr: Plage de longueur d'onde
it: Intervallo lunghezza d'onda
pt_br: Faixa de comprimento de onda
ru: Диапазон длин волн
zh_hans: 波长范围

# ui.subtabs.metrics
source: Metrics
de: Metriken
es: Métricas
fr: Métriques
it: Metriche
pt_br: Métricas
ru: Метрики
zh_hans: 指标

# ui.subtabs.tm30_hue
source: TM-30 Hue
de: TM-30 Farbton
es: TM-30 Tono
fr: TM-30 Teinte
it: TM-30 Tonalità
pt_br: TM-30 Matiz
ru: TM-30 Тон
zh_hans: TM-30 色调

# ui.tabs.analysis
source: Analysis
de: Analyse
es: Análisis
fr: Analyse
it: Analisi
pt_br: Análise
ru: Анализ
zh_hans: 分析

# ui.tabs.cartesian
source: Cartesian
de: Kartesisch
es: Cartesiano
fr: Cartésien
it: Cartesiano
pt_br: Cartesiano
ru: Декартова
zh_hans: 直角坐标

# ui.tabs.compare
source: Compare
de: Vergleich
es: Comparar
fr: Comparer
it: Confronta
pt_br: Comparar
ru: Сравнение
zh_hans: 比较

# ui.tabs.cone
source: Cone
de: Kegel
es: Cono
fr: Cône
it: Cono
ru: Конус
zh_hans: 光锥

# ui.tabs.data
source: Data
de: Daten
es: Datos
fr: Données
it: Dati
pt_br: Dados
ru: Данные
zh_hans: 数据

# ui.tabs.diagrams
source: Diagrams
de: Diagramme
es: Diagramas
fr: Diagrammes
it: Diagrammi
pt_br: Diagramas
ru: Диаграммы
zh_hans: 图表

# ui.tabs.dimensions
source: Dimensions
de: Abmessungen
es: Dimensiones
it: Dimensioni
pt_br: Dimensões
ru: Размеры
zh_hans: 尺寸

# ui.tabs.direct_ratios
source: Direct Ratios
de: Direkt-Verhältnisse
es: Ratios directos
fr: Ratios directs
it: Rapporti diretti
pt_br: Razões diretas
ru: Прямые коэффициенты
zh_hans: 直接比率

# ui.tabs.floodlight
source: Floodlight
de: Flutlicht
es: Proyector
fr: Projecteur
it: Proiettore
pt_br: Projetor
ru: Прожектор
zh_hans: 投光灯

# ui.tabs.floodlight_isocandela
source: Isocandela
de: Isokandela
ru: Изокандела
zh_hans: 等光强

# ui.tabs.floodlight_vh
source: V-H Diagram
de: V-H Diagramm
es: Diagrama V-H
fr: Diagramme V-H
it: Diagramma V-H
pt_br: Diagrama V-H
ru: V-H диаграмма
zh_hans: V-H图

# ui.tabs.general
source: General
de: Allgemein
fr: Général
it: Generale
pt_br: Geral
ru: Общие
zh_hans: 常规

# ui.tabs.greenhouse
source: Greenhouse
de: Gewächshaus
es: Invernadero
fr: Serre
it: Serra
pt_br: Estufa
ru: Теплица
zh_hans: 温室

# ui.tabs.intensity
source: Intensity
de: Lichtstärke
es: Intensidad
fr: Intensité
it: Intensità
pt_br: Intensidade
ru: Сила света
zh_hans: 光强

# ui.tabs.lamp_sets
source: Lamp Sets
de: Leuchtmittel
es: Lámparas
fr: Lampes
it: Set lampade
pt_br: Lâmpadas
ru: Лампы
zh_hans: 光源组

# ui.tabs.scene_3d
source: 3D Scene
de: 3D-Szene
es: Escena 3D
fr: Scène 3D
it: Scena 3D
pt_br: Cena 3D
ru: 3D-сцена
zh_hans: 3D场景

# ui.tabs.spectral
source: Spectral
de: Spektral
es: Espectral
it: Spettrale
pt_br: Espectral
ru: Спектр
zh_hans: 光谱

# ui.tabs.validation
source: Validation
de: Validierung
es: Validación
it: Validazione
pt_br: Validação
ru: Проверка
zh_hans: 验证

# ui.template.atla_fluorescent_json
source: ATLA Fluorescent (JSON)
de: ATLA Leuchtstoff (JSON)
es: ATLA Fluorescente (JSON)
it: ATLA Fluorescente (JSON)
pt_br: ATLA Fluorescente (JSON)
ru: ATLA Люминесцентный (JSON)
zh_hans: ATLA 荧光灯 (JSON)

# ui.template.atla_fluorescent_xml
source: ATLA Fluorescent (XML)
de: ATLA Leuchtstoff (XML)
es: ATLA Fluorescente (XML)
it: ATLA Fluorescente (XML)
pt_br: ATLA Fluorescente (XML)
ru: ATLA Люминесцентный (XML)
zh_hans: ATLA 荧光灯 (XML)

# ui.template.atla_grow_light_fs
source: ATLA Grow Light (Full Spectrum)
de: ATLA Pflanzenlampe (Vollspektrum)
es: ATLA Lámpara de cultivo (espectro completo)
fr: ATLA Lampe horticole (spectre complet)
it: ATLA Lampada per piante (spettro completo)
pt_br: ATLA Luz de cultivo (espectro completo)
ru: ATLA Фитолампа (полный спектр)
zh_hans: ATLA 植物灯 (全光谱)

# ui.template.atla_grow_light_rb
source: ATLA Grow Light (Red/Blue)
de: ATLA Pflanzenlampe (Rot/Blau)
es: ATLA Lámpara de cultivo (rojo/azul)
fr: ATLA Lampe horticole (rouge/bleu)
it: ATLA Lampada per piante (rosso/blu)
pt_br: ATLA Luz de cultivo (vermelho/azul)
ru: ATLA Фитолампа (красный/синий)
zh_hans: ATLA 植物灯 (红蓝)

# ui.template.fluorescent
source: Fluorescent Luminaire
de: Leuchtstofflampe
es: Luminaria fluorescente
fr: Luminaire fluorescent
it: Apparecchio fluorescente
pt_br: Luminária fluorescente
ru: Люминесцентный светильник
zh_hans: 荧光灯具

# ui.template.halogen
source: ATLA Halogen Lamp (IR)
de: ATLA Halogenlampe (IR)
es: ATLA Halógena (IR)
fr: ATLA Lampe halogène (IR)
it: ATLA Lampada alogena (IR)
pt_br: ATLA Halógena (IV)
ru: ATLA Галогенная (ИК)
zh_hans: ATLA 卤素灯 (红外)

# ui.template.heat_lamp
source: ATLA Heat Lamp (High IR)
de: ATLA Wärmelampe (hoher IR)
es: ATLA Lámpara de calor (alto IR)
fr: ATLA Lampe chauffante (IR élevé)
it: ATLA Lampada riscaldante (IR elevato)
pt_br: ATLA Lâmpada de aquecimento (alto IV)
ru: ATLA Инфракрасная (высокий ИК)
zh_hans: ATLA 加热灯 (高红外)

# ui.template.incandescent
source: ATLA Incandescent (IR)
de: ATLA Glühlampe (IR)
es: ATLA Incandescente (IR)
it: ATLA Incandescenza (IR)
pt_br: ATLA Incandescente (IV)
ru: ATLA Накаливания (ИК)
zh_hans: ATLA 白炽灯 (红外)

# ui.template.linear
source: Linear Luminaire
de: Linearleuchte
es: Luminaria lineal
fr: Luminaire linéaire
it: Apparecchio lineare
pt_br: Luminária linear
ru: Линейный светильник
zh_hans: 线性灯具

# ui.template.projector
source: Projector
de: Projektor
es: Proyector
fr: Projecteur
it: Proiettore
pt_br: Projetor
ru: Прожектор
zh_hans: 投射灯

# ui.template.road
source: Road Luminaire
de: Straßenleuchte
es: Luminaria vial
fr: Luminaire routier
it: Apparecchio stradale
pt_br: Luminária viária
ru: Дорожный светильник
zh_hans: 道路灯具

# ui.template.select
source: Select Template
de: Vorlage wählen
es: Seleccionar plantilla
fr: Sélectionner un modèle
it: Seleziona modello
pt_br: Selecionar modelo
ru: Выбрать шаблон
zh_hans: 选择模板

# ui.template.uplight
source: Floor Uplight
de: Steh-Uplight
es: Luminaria de suelo ascendente
fr: Lampadaire vers le haut
it: Lampada a luce verso l'alto
pt_br: Luminária de piso ascendente
ru: Напольный аплайт
zh_hans: 落地上射灯

# ui.template.uv_blacklight
source: ATLA UV Blacklight
de: ATLA UV-Schwarzlicht
es: ATLA Luz negra UV
fr: ATLA Lumière noire UV
it: ATLA Luce nera UV
pt_br: ATLA Luz negra UV
ru: ATLA УФ-лампа чёрного света
zh_hans: ATLA 紫外黑光灯

# ui.theme.dark
source: Dark
de: Dunkel
es: Oscuro
fr: Sombre
it: Scuro
pt_br: Escuro
ru: Тёмная
zh_hans: 深色

# ui.theme.light
source: Light
de: Hell
es: Claro
fr: Clair
it: Chiaro
pt_br: Claro
ru: Светлая
zh_hans: 浅色

# ui.validation_panel.all_passed
source: All validation checks passed
de: Alle Validierungsprüfungen bestanden
es: Todas las verificaciones pasaron
fr: Toutes les vérifications de validation ont réussi
it: Tutti i controlli di validazione superati
pt_br: Todas as verificações passaram
ru: Все проверки пройдены
zh_hans: 所有验证检查已通过

# ui.validation_panel.error_count
source: {errors} error(s), {warnings} warning(s)
de: {errors} Fehler, {warnings} Warnungen
es: {errors} error(es), {warnings} advertencia(s)
fr: {errors} erreur(s), {warnings} avertissement(s)
it: {errors} errore/i, {warnings} avviso/i
pt_br: {errors} erro(s), {warnings} aviso(s)
ru: {errors} ошибок, {warnings} предупреждений
zh_hans: {errors}个错误，{warnings}个警告

# ui.validation.title
source: Validation Results
de: Validierungsergebnisse
es: Resultados de validación
fr: Résultats de validation
it: Risultati validazione
pt_br: Resultados da validação
ru: Результаты проверки
zh_hans: 验证结果

# validation.level.error
source: Error
de: Fehler
fr: Erreur
it: Errore
pt_br: Erro
ru: Ошибка
zh_hans: 错误

# validation.level.warning
source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
it: Avviso
pt_br: Aviso
ru: Предупреждение
zh_hans: 警告

# validation.messages.e001
source: No intensity data
de: Keine Lichtstärkedaten
es: Sin datos de intensidad
fr: Aucune donnée d'intensité
it: Nessun dato di intensità
pt_br: Sem dados de intensidade
ru: Отсутствуют данные силы света
zh_hans: 无光强数据

# validation.messages.e002
source: No G-planes defined
de: Keine G-Ebenen definiert
es: No hay planos G definidos
fr: Aucun plan G défini
it: Nessun piano G definito
pt_br: Nenhum plano G definido
ru: G-плоскости не определены
zh_hans: 未定义G平面

# validation.messages.e003
source: No lamp sets defined
de: Keine Leuchtmittelsets definiert
es: No hay conjuntos de lámparas definidos
fr: Aucun ensemble de lampes défini
it: Nessun set di lampade definito
pt_br: Nenhum conjunto de lâmpadas definido
ru: Наборы ламп не определены
zh_hans: 未定义光源组

# validation.messages.e004
source: Intensity data dimension mismatch: {0} C-planes, expected {1}
de: Lichtstärkedaten-Dimensionsfehler: {0} C-Ebenen, erwartet {1}
es: Dimensión de datos de intensidad no coincidente: {0} planos C, se esperaban {1}
fr: Incohérence des dimensions des données d'intensité : {0} plans C, {1} attendus
it: Dimensione dati di intensità non corrispondente: {0} piani C, previsti {1}
pt_br: Incompatibilidade de dimensão dos dados de intensidade: {0} planos C, esperado {1}
ru: Несоответствие размерности данных силы света: {0} C-плоскостей, ожидается {1}
zh_hans: 光强数据维度不匹配：{0} 个C平面，应为 {1} 个

# validation.messages.e005
source: G-angles count ({0}) doesn't match num_g_planes ({1})
de: G-Winkel-Anzahl ({0}) stimmt nicht mit num_g_planes ({1}) überein
es: El número de ángulos G ({0}) no coincide con num_g_planes ({1})
fr: Le nombre d'angles G ({0}) ne correspond pas à num_g_planes ({1})
it: Il conteggio degli angoli G ({0}) non corrisponde a num_g_planes ({1})
pt_br: Contagem de ângulos G ({0}) não corresponde a num_g_planes ({1})
ru: Количество G-углов ({0}) не соответствует num_g_planes ({1})
zh_hans: G角数量 ({0}) 与 num_g_planes ({1}) 不匹配

# validation.messages.e006
source: C-angles count ({0}) doesn't match expected Mc ({1})
de: C-Winkel-Anzahl ({0}) stimmt nicht mit erwartetem Mc ({1}) überein
es: El número de ángulos C ({0}) no coincide con el Mc esperado ({1})
fr: Le nombre d'angles C ({0}) ne correspond pas au Mc attendu ({1})
it: Il conteggio degli angoli C ({0}) non corrisponde al Mc previsto ({1})
pt_br: Contagem de ângulos C ({0}) não corresponde ao Mc esperado ({1})
ru: Количество C-углов ({0}) не соответствует ожидаемому Mc ({1})
zh_hans: C角数量 ({0}) 与预期 Mc ({1}) 不匹配

# validation.messages.w001
source: Type indicator value is out of range (1-3)
de: Typenindikator-Wert ist außerhalb des Bereichs (1-3)
es: El valor del indicador de tipo está fuera de rango (1-3)
fr: L'indicateur de type est hors plage (1-3)
it: Il valore dell'indicatore di tipo è fuori intervallo (1-3)
pt_br: Valor do indicador de tipo fora do intervalo (1-3)
ru: Значение индикатора типа вне допустимого диапазона (1-3)
zh_hans: 类型指示器值超出范围 (1-3)

# validation.messages.w002
source: Symmetry indicator value is out of range (0-4)
de: Symmetrie-Indikator-Wert ist außerhalb des Bereichs (0-4)
es: El valor del indicador de simetría está fuera de rango (0-4)
fr: L'indicateur de symétrie est hors plage (0-4)
it: Il valore dell'indicatore di simmetria è fuori intervallo (0-4)
pt_br: Valor do indicador de simetria fora do intervalo (0-4)
ru: Значение индикатора симметрии вне допустимого диапазона (0-4)
zh_hans: 对称性指示器值超出范围 (0-4)

# validation.messages.w003
source: Number of C-planes ({0}) exceeds maximum (721)
de: Anzahl der C-Ebenen ({0}) überschreitet das Maximum (721)
es: El número de planos C ({0}) supera el máximo (721)
fr: Le nombre de plans C ({0}) dépasse le maximum (721)
it: Il numero di piani C ({0}) supera il massimo (721)
pt_br: Número de planos C ({0}) excede o máximo (721)
ru: Количество C-плоскостей ({0}) превышает максимум (721)
zh_hans: C平面数量 ({0}) 超过最大值 (721)

# validation.messages.w004
source: Distance between C-planes ({0}) is out of range (0-360)
de: Abstand zwischen C-Ebenen ({0}) ist außerhalb des Bereichs (0-360)
es: La distancia entre planos C ({0}) está fuera de rango (0-360)
fr: La distance entre les plans C ({0}) est hors plage (0-360)
it: La distanza tra i piani C ({0}) è fuori intervallo (0-360)
pt_br: Distância entre planos C ({0}) fora do intervalo (0-360)
ru: Расстояние между C-плоскостями ({0}) вне допустимого диапазона (0-360)
zh_hans: C平面间距 ({0}) 超出范围 (0-360)

# validation.messages.w005
source: Number of G-planes ({0}) exceeds maximum (361)
de: Anzahl der G-Ebenen ({0}) überschreitet das Maximum (361)
es: El número de planos G ({0}) supera el máximo (361)
fr: Le nombre de plans G ({0}) dépasse le maximum (361)
it: Il numero di piani G ({0}) supera il massimo (361)
pt_br: Número de planos G ({0}) excede o máximo (361)
ru: Количество G-плоскостей ({0}) превышает максимум (361)
zh_hans: G平面数量 ({0}) 超过最大值 (361)

# validation.messages.w006
source: Distance between G-planes ({0}) is out of range (0-180)
de: Abstand zwischen G-Ebenen ({0}) ist außerhalb des Bereichs (0-180)
es: La distancia entre planos G ({0}) está fuera de rango (0-180)
fr: La distance entre les plans G ({0}) est hors plage (0-180)
it: La distanza tra i piani G ({0}) è fuori intervallo (0-180)
pt_br: Distância entre planos G ({0}) fora do intervalo (0-180)
ru: Расстояние между G-плоскостями ({0}) вне допустимого диапазона (0-180)
zh_hans: G平面间距 ({0}) 超出范围 (0-180)

# validation.messages.w007
source: Measurement report number exceeds {0} characters
de: Messberichtsnummer überschreitet {0} Zeichen
es: El número de informe de medición supera {0} caracteres
fr: Le numéro de rapport de mesure dépasse {0} caractères
it: Il numero del rapporto di misura supera {0} caratteri
pt_br: Número do relatório de medição excede {0} caracteres
ru: Номер отчёта измерений превышает {0} символов
zh_hans: 测量报告编号超过 {0} 个字符

# validation.messages.w008
source: Luminaire name exceeds {0} characters
de: Leuchtenname überschreitet {0} Zeichen
es: El nombre de la luminaria supera {0} caracteres
fr: Le nom du luminaire dépasse {0} caractères
it: Il nome dell'apparecchio supera {0} caratteri
pt_br: Nome da luminária excede {0} caracteres
ru: Название светильника превышает {0} символов
zh_hans: 灯具名称超过 {0} 个字符

# validation.messages.w009
source: Luminaire number exceeds {0} characters
de: Leuchtennummer überschreitet {0} Zeichen
es: El número de la luminaria supera {0} caracteres
fr: Le numéro du luminaire dépasse {0} caractères
it: Il numero dell'apparecchio supera {0} caratteri
pt_br: Número da luminária excede {0} caracteres
ru: Номер светильника превышает {0} символов
zh_hans: 灯具编号超过 {0} 个字符

# validation.messages.w010
source: File name exceeds {0} characters
de: Dateiname überschreitet {0} Zeichen
es: El nombre del archivo supera {0} caracteres
fr: Le nom du fichier dépasse {0} caractères
it: Il nome del file supera {0} caratteri
pt_br: Nome do arquivo excede {0} caracteres
ru: Имя файла превышает {0} символов
zh_hans: 文件名超过 {0} 个字符

# validation.messages.w011
source: Date/user field exceeds {0} characters
de: Datum/Benutzer-Feld überschreitet {0} Zeichen
es: El campo fecha/usuario supera {0} caracteres
fr: Le champ date/utilisateur dépasse {0} caractères
it: Il campo data/utente supera {0} caratteri
pt_br: Campo de data/usuário excede {0} caracteres
ru: Поле даты/пользователя превышает {0} символов
zh_hans: 日期/用户字段超过 {0} 个字符

# validation.messages.w012
source: Luminaire length is negative
de: Leuchtenlänge ist negativ
es: La longitud de la luminaria es negativa
fr: La longueur du luminaire est négative
it: La lunghezza dell'apparecchio è negativa
pt_br: Comprimento da luminária é negativo
ru: Длина светильника отрицательная
zh_hans: 灯具长度为负值

# validation.messages.w013
source: Luminaire width is negative
de: Leuchtenbreite ist negativ
es: La anchura de la luminaria es negativa
fr: La largeur du luminaire est négative
it: La larghezza dell'apparecchio è negativa
pt_br: Largura da luminária é negativa
ru: Ширина светильника отрицательная
zh_hans: 灯具宽度为负值

# validation.messages.w014
source: Luminaire height is negative
de: Leuchtenhöhe ist negativ
es: La altura de la luminaria es negativa
fr: La hauteur du luminaire est négative
it: L'altezza dell'apparecchio è negativa
pt_br: Altura da luminária é negativa
ru: Высота светильника отрицательная
zh_hans: 灯具高度为负值

# validation.messages.w015
source: Luminous area length is negative
de: Leuchtflächenlänge ist negativ
es: La longitud del área luminosa es negativa
fr: La longueur de la surface lumineuse est négative
it: La lunghezza dell'area luminosa è negativa
pt_br: Comprimento da área luminosa é negativo
ru: Длина светящейся области отрицательная
zh_hans: 发光面积长度为负值

# validation.messages.w016
source: Luminous area width is negative
de: Leuchtflächenbreite ist negativ
es: La anchura del área luminosa es negativa
fr: La largeur de la surface lumineuse est négative
it: La larghezza dell'area luminosa è negativa
pt_br: Largura da área luminosa é negativa
ru: Ширина светящейся области отрицательная
zh_hans: 发光面积宽度为负值

# validation.messages.w017
source: Luminous area length exceeds luminaire length
de: Leuchtflächenlänge überschreitet die Leuchtenlänge
es: La longitud del área luminosa supera la longitud de la luminaria
fr: La longueur de la surface lumineuse dépasse la longueur du luminaire
it: La lunghezza dell'area luminosa supera la lunghezza dell'apparecchio
pt_br: Comprimento da área luminosa excede o comprimento da luminária
ru: Длина светящейся области превышает длину светильника
zh_hans: 发光面积长度超过灯具长度

# validation.messages.w018
source: Luminous area width exceeds luminaire width
de: Leuchtflächenbreite überschreitet die Leuchtenbreite
es: La anchura del área luminosa supera la anchura de la luminaria
fr: La largeur de la surface lumineuse dépasse la largeur du luminaire
it: La larghezza dell'area luminosa supera la larghezza dell'apparecchio
pt_br: Largura da área luminosa excede a largura da luminária
ru: Ширина светящейся области превышает ширину светильника
zh_hans: 发光面积宽度超过灯具宽度

# validation.messages.w019
source: Downward flux fraction ({0}) is out of range (0-100%)
de: Anteil Abwärtslichtstrom ({0}) ist außerhalb des Bereichs (0-100%)
es: La fracción de flujo descendente ({0}) está fuera de rango (0-100%)
fr: La fraction de flux descendant ({0}) est hors plage (0-100%)
it: La frazione di flusso verso il basso ({0}) è fuori intervallo (0-100%)
pt_br: Fração de fluxo descendente ({0}) fora do intervalo (0-100%)
ru: Доля нижнего потока ({0}) вне допустимого диапазона (0-100%)
zh_hans: 下射光通量比 ({0}) 超出范围 (0-100%)

# validation.messages.w020
source: Light output ratio ({0}) is out of range (0-100%)
de: Leuchtenbetriebswirkungsgrad ({0}) ist außerhalb des Bereichs (0-100%)
es: El rendimiento de luminaria ({0}) está fuera de rango (0-100%)
fr: Le rendement lumineux ({0}) est hors plage (0-100%)
it: Il rapporto di uscita luminosa ({0}) è fuori intervallo (0-100%)
pt_br: Rendimento da luminária ({0}) fora do intervalo (0-100%)
ru: КПД светильника ({0}) вне допустимого диапазона (0-100%)
zh_hans: 灯具光输出比 ({0}) 超出范围 (0-100%)

# validation.messages.w021
source: Conversion factor should be positive
de: Umrechnungsfaktor sollte positiv sein
es: El factor de conversión debe ser positivo
fr: Le facteur de conversion doit être positif
it: Il fattore di conversione deve essere positivo
pt_br: Fator de conversão deve ser positivo
ru: Коэффициент преобразования должен быть положительным
zh_hans: 转换系数应为正值

# validation.messages.w022
source: Tilt angle ({0}) is out of typical range (-90 to 90)
de: Neigungswinkel ({0}) ist außerhalb des üblichen Bereichs (-90 bis 90)
es: El ángulo de inclinación ({0}) está fuera del rango típico (-90 a 90)
fr: L'angle d'inclinaison ({0}) est hors de la plage typique (-90 à 90)
it: L'angolo di inclinazione ({0}) è fuori dall'intervallo tipico (-90 a 90)
pt_br: Ângulo de inclinação ({0}) fora da faixa típica (-90 a 90)
ru: Угол наклона ({0}) вне типичного диапазона (от -90 до 90)
zh_hans: 倾斜角度 ({0}) 超出常规范围 (-90至90)

# validation.messages.w023
source: No lamp sets defined
de: Keine Leuchtmittelsets definiert
es: No hay conjuntos de lámparas definidos
fr: Aucun ensemble de lampes défini
it: Nessun set di lampade definito
pt_br: Nenhum conjunto de lâmpadas definido
ru: Наборы ламп не определены
zh_hans: 未定义光源组

# validation.messages.w024
source: Number of lamp sets ({0}) exceeds maximum (20)
de: Anzahl der Leuchtmittelsets ({0}) überschreitet das Maximum (20)
es: El número de conjuntos de lámparas ({0}) supera el máximo (20)
fr: Le nombre d'ensembles de lampes ({0}) dépasse le maximum (20)
it: Il numero di set di lampade ({0}) supera il massimo (20)
pt_br: Número de conjuntos de lâmpadas ({0}) excede o máximo (20)
ru: Количество наборов ламп ({0}) превышает максимум (20)
zh_hans: 光源组数量 ({0}) 超过最大值 (20)

# validation.messages.w025
source: Lamp set {0} has invalid lamp count ({1})
de: Leuchtmittelset {0} hat ungültige Lampenanzahl ({1})
es: El conjunto de lámparas {0} tiene un número de lámparas no válido ({1})
fr: L'ensemble de lampes {0} a un nombre de lampes invalide ({1})
it: Il set di lampade {0} ha un conteggio lampade non valido ({1})
pt_br: Conjunto de lâmpadas {0} possui contagem de lâmpadas inválida ({1})
ru: Набор ламп {0} имеет недопустимое количество ламп ({1})
zh_hans: 光源组 {0} 的灯具数量无效 ({1})

# validation.messages.w026
source: Lamp set {0} has negative luminous flux
de: Leuchtmittelset {0} hat negativen Lichtstrom
es: El conjunto de lámparas {0} tiene flujo luminoso negativo
fr: L'ensemble de lampes {0} a un flux lumineux négatif
it: Il set di lampade {0} ha flusso luminoso negativo
pt_br: Conjunto de lâmpadas {0} possui fluxo luminoso negativo
ru: Набор ламп {0} имеет отрицательный световой поток
zh_hans: 光源组 {0} 的光通量为负值
